ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/device/TOOLCHAIN_ARM_STD/startup_MIMXRT1176_cm7.S
LPUART3_IRQHandler\
                PROC
                EXPORT  LPUART3_IRQHandler         [WEAK]
                LDR     R0, =LPUART3_DriverIRQHandler
                BX      R0
                ENDP

LPUART4_IRQHandler\
                PROC
                EXPORT  LPUART4_IRQHandler         [WEAK]
                LDR     R0, =LPUART4_DriverIRQHandler
                BX      R0
                ENDP

LPUART5_IRQHandler\
                PROC
                EXPORT  LPUART5_IRQHandler         [WEAK]
                LDR     R0, =LPUART5_DriverIRQHandler
                BX      R0
                ENDP

LPUART6_IRQHandler\
                PROC
                EXPORT  LPUART6_IRQHandler         [WEAK]
                LDR     R0, =LPUART6_DriverIRQHandler
                BX      R0
                ENDP

LPUART7_IRQHandler\
                PROC
                EXPORT  LPUART7_IRQHandler         [WEAK]
                LDR     R0, =LPUART7_DriverIRQHandler
                BX      R0
                ENDP

LPUART8_IRQHandler\
                PROC
                EXPORT  LPUART8_IRQHandler         [WEAK]
                LDR     R0, =LPUART8_DriverIRQHandler
                BX      R0
                ENDP

LPUART9_IRQHandler\
                PROC
                EXPORT  LPUART9_IRQHandler         [WEAK]
                LDR     R0, =LPUART9_DriverIRQHandler
                BX      R0
                ENDP

LPUART10_IRQHandler\
                PROC
                EXPORT  LPUART10_IRQHandler         [WEAK]
                LDR     R0, =LPUART10_DriverIRQHandler
                BX      R0
                ENDP

LPUART11_IRQHandler\
                PROC
                EXPORT  LPUART11_IRQHandler         [WEAK]
                LDR     R0, =LPUART11_DriverIRQHandler
                BX      R0
                ENDP

LPUART12_IRQHandler\
                PROC
                EXPORT  LPUART12_IRQHandler         [WEAK]
                LDR     R0, =LPUART12_DriverIRQHandler
                BX      R0
                ENDP

LPI2C1_IRQHandler\
                PROC
                EXPORT  LPI2C1_IRQHandler         [WEAK]
                LDR     R0, =LPI2C1_DriverIRQHandler
                BX      R0
                ENDP

LPI2C2_IRQHandler\
                PROC
                EXPORT  LPI2C2_IRQHandler         [WEAK]
                LDR     R0, =LPI2C2_DriverIRQHandler
                BX      R0
                ENDP

LPI2C3_IRQHandler\
                PROC
                EXPORT  LPI2C3_IRQHandler         [WEAK]
                LDR     R0, =LPI2C3_DriverIRQHandler
                BX      R0
                ENDP

LPI2C4_IRQHandler\
                PROC
                EXPORT  LPI2C4_IRQHandler         [WEAK]
                LDR     R0, =LPI2C4_DriverIRQHandler
                BX      R0
                ENDP

LPI2C5_IRQHandler\
                PROC
                EXPORT  LPI2C5_IRQHandler         [WEAK]
                LDR     R0, =LPI2C5_DriverIRQHandler
                BX      R0
                ENDP

LPI2C6_IRQHandler\
                PROC
                EXPORT  LPI2C6_IRQHandler         [WEAK]
                LDR     R0, =LPI2C6_DriverIRQHandler
                BX      R0
                ENDP

LPSPI1_IRQHandler\
                PROC
                EXPORT  LPSPI1_IRQHandler         [WEAK]
                LDR     R0, =LPSPI1_DriverIRQHandler
                BX      R0
                ENDP

LPSPI2_IRQHandler\
                PROC
                EXPORT  LPSPI2_IRQHandler         [WEAK]
                LDR     R0, =LPSPI2_DriverIRQHandler
                BX      R0
                ENDP

LPSPI3_IRQHandler\
                PROC
                EXPORT  LPSPI3_IRQHandler         [WEAK]
                LDR     R0, =LPSPI3_DriverIRQHandler
                BX      R0
                ENDP

LPSPI4_IRQHandler\
                PROC
                EXPORT  LPSPI4_IRQHandler         [WEAK]
                LDR     R0, =LPSPI4_DriverIRQHandler
                BX      R0
                ENDP

LPSPI5_IRQHandler\
                PROC
                EXPORT  LPSPI5_IRQHandler         [WEAK]
                LDR     R0, =LPSPI5_DriverIRQHandler
                BX      R0
                ENDP

LPSPI6_IRQHandler\
                PROC
                EXPORT  LPSPI6_IRQHandler         [WEAK]
                LDR     R0, =LPSPI6_DriverIRQHandler
                BX      R0
                ENDP

CAN1_IRQHandler\
                PROC
                EXPORT  CAN1_IRQHandler         [WEAK]
                LDR     R0, =CAN1_DriverIRQHandler
                BX      R0
                ENDP

CAN1_ERROR_IRQHandler\
                PROC
                EXPORT  CAN1_ERROR_IRQHandler         [WEAK]
                LDR     R0, =CAN1_ERROR_DriverIRQHandler
                BX      R0
                ENDP

CAN2_IRQHandler\
                PROC
                EXPORT  CAN2_IRQHandler         [WEAK]
                LDR     R0, =CAN2_DriverIRQHandler
                BX      R0
                ENDP

CAN2_ERROR_IRQHandler\
                PROC
                EXPORT  CAN2_ERROR_IRQHandler         [WEAK]
                LDR     R0, =CAN2_ERROR_DriverIRQHandler
                BX      R0
                ENDP

CAN3_IRQHandler\
                PROC
                EXPORT  CAN3_IRQHandler         [WEAK]
                LDR     R0, =CAN3_DriverIRQHandler
                BX      R0
                ENDP

CAN3_ERROR_IRQHandler\
                PROC
                EXPORT  CAN3_ERROR_IRQHandler         [WEAK]
                LDR     R0, =CAN3_ERROR_DriverIRQHandler
                BX      R0
                ENDP

CDOG_IRQHandler\
                PROC
                EXPORT  CDOG_IRQHandler         [WEAK]
                LDR     R0, =CDOG_DriverIRQHandler
                BX      R0
                ENDP

SAI1_IRQHandler\
                PROC
                EXPORT  SAI1_IRQHandler         [WEAK]
                LDR     R0, =SAI1_DriverIRQHandler
                BX      R0
                ENDP

SAI2_IRQHandler\
                PROC
                EXPORT  SAI2_IRQHandler         [WEAK]
                LDR     R0, =SAI2_DriverIRQHandler
                BX      R0
                ENDP

