ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/device/TOOLCHAIN_ARM_STD/startup_MIMXRT1176_cm7.S
SAI3_RX_IRQHandler\
                PROC
                EXPORT  SAI3_RX_IRQHandler         [WEAK]
                LDR     R0, =SAI3_RX_DriverIRQHandler
                BX      R0
                ENDP

SAI3_TX_IRQHandler\
                PROC
                EXPORT  SAI3_TX_IRQHandler         [WEAK]
                LDR     R0, =SAI3_TX_DriverIRQHandler
                BX      R0
                ENDP

SAI4_RX_IRQHandler\
                PROC
                EXPORT  SAI4_RX_IRQHandler         [WEAK]
                LDR     R0, =SAI4_RX_DriverIRQHandler
                BX      R0
                ENDP

SAI4_TX_IRQHandler\
                PROC
                EXPORT  SAI4_TX_IRQHandler         [WEAK]
                LDR     R0, =SAI4_TX_DriverIRQHandler
                BX      R0
                ENDP

SPDIF_IRQHandler\
                PROC
                EXPORT  SPDIF_IRQHandler         [WEAK]
                LDR     R0, =SPDIF_DriverIRQHandler
                BX      R0
                ENDP

ASRC_IRQHandler\
                PROC
                EXPORT  ASRC_IRQHandler         [WEAK]
                LDR     R0, =ASRC_DriverIRQHandler
                BX      R0
                ENDP

FLEXIO1_IRQHandler\
                PROC
                EXPORT  FLEXIO1_IRQHandler         [WEAK]
                LDR     R0, =FLEXIO1_DriverIRQHandler
                BX      R0
                ENDP

FLEXIO2_IRQHandler\
                PROC
                EXPORT  FLEXIO2_IRQHandler         [WEAK]
                LDR     R0, =FLEXIO2_DriverIRQHandler
                BX      R0
                ENDP

FLEXSPI1_IRQHandler\
                PROC
                EXPORT  FLEXSPI1_IRQHandler         [WEAK]
                LDR     R0, =FLEXSPI1_DriverIRQHandler
                BX      R0
                ENDP

FLEXSPI2_IRQHandler\
                PROC
                EXPORT  FLEXSPI2_IRQHandler         [WEAK]
                LDR     R0, =FLEXSPI2_DriverIRQHandler
                BX      R0
                ENDP

USDHC1_IRQHandler\
                PROC
                EXPORT  USDHC1_IRQHandler         [WEAK]
                LDR     R0, =USDHC1_DriverIRQHandler
                BX      R0
                ENDP

USDHC2_IRQHandler\
                PROC
                EXPORT  USDHC2_IRQHandler         [WEAK]
                LDR     R0, =USDHC2_DriverIRQHandler
                BX      R0
                ENDP

ENET_IRQHandler\
                PROC
                EXPORT  ENET_IRQHandler         [WEAK]
                LDR     R0, =ENET_DriverIRQHandler
                BX      R0
                ENDP

ENET_1588_Timer_IRQHandler\
                PROC
                EXPORT  ENET_1588_Timer_IRQHandler         [WEAK]
                LDR     R0, =ENET_1588_Timer_DriverIRQHandler
                BX      R0
                ENDP

ENET_MAC0_Tx_Rx_Done_0_IRQHandler\
                PROC
                EXPORT  ENET_MAC0_Tx_Rx_Done_0_IRQHandler         [WEAK]
                LDR     R0, =ENET_MAC0_Tx_Rx_Done_0_DriverIRQHandler
                BX      R0
                ENDP

ENET_MAC0_Tx_Rx_Done_1_IRQHandler\
                PROC
                EXPORT  ENET_MAC0_Tx_Rx_Done_1_IRQHandler         [WEAK]
                LDR     R0, =ENET_MAC0_Tx_Rx_Done_1_DriverIRQHandler
                BX      R0
                ENDP

ENET_1G_IRQHandler\
                PROC
                EXPORT  ENET_1G_IRQHandler         [WEAK]
                LDR     R0, =ENET_1G_DriverIRQHandler
                BX      R0
                ENDP

ENET_1G_1588_Timer_IRQHandler\
                PROC
                EXPORT  ENET_1G_1588_Timer_IRQHandler         [WEAK]
                LDR     R0, =ENET_1G_1588_Timer_DriverIRQHandler
                BX      R0
                ENDP

HWVAD_EVENT_IRQHandler\
                PROC
                EXPORT  HWVAD_EVENT_IRQHandler         [WEAK]
                LDR     R0, =HWVAD_EVENT_DriverIRQHandler
                BX      R0
                ENDP

HWVAD_ERROR_IRQHandler\
                PROC
                EXPORT  HWVAD_ERROR_IRQHandler         [WEAK]
                LDR     R0, =HWVAD_ERROR_DriverIRQHandler
                BX      R0
                ENDP

PDM_EVENT_IRQHandler\
                PROC
                EXPORT  PDM_EVENT_IRQHandler         [WEAK]
                LDR     R0, =PDM_EVENT_DriverIRQHandler
                BX      R0
                ENDP

PDM_ERROR_IRQHandler\
                PROC
                EXPORT  PDM_ERROR_IRQHandler         [WEAK]
                LDR     R0, =PDM_ERROR_DriverIRQHandler
                BX      R0
                ENDP

XECC_FLEXSPI1_INT_IRQHandler\
                PROC
                EXPORT  XECC_FLEXSPI1_INT_IRQHandler         [WEAK]
                LDR     R0, =XECC_FLEXSPI1_INT_DriverIRQHandler
                BX      R0
                ENDP

XECC_FLEXSPI1_FATAL_INT_IRQHandler\
                PROC
                EXPORT  XECC_FLEXSPI1_FATAL_INT_IRQHandler         [WEAK]
                LDR     R0, =XECC_FLEXSPI1_FATAL_INT_DriverIRQHandler
                BX      R0
                ENDP

XECC_FLEXSPI2_INT_IRQHandler\
                PROC
                EXPORT  XECC_FLEXSPI2_INT_IRQHandler         [WEAK]
                LDR     R0, =XECC_FLEXSPI2_INT_DriverIRQHandler
                BX      R0
                ENDP

XECC_FLEXSPI2_FATAL_INT_IRQHandler\
                PROC
                EXPORT  XECC_FLEXSPI2_FATAL_INT_IRQHandler         [WEAK]
                LDR     R0, =XECC_FLEXSPI2_FATAL_INT_DriverIRQHandler
                BX      R0
                ENDP

ENET_QOS_IRQHandler\
                PROC
                EXPORT  ENET_QOS_IRQHandler         [WEAK]
                LDR     R0, =ENET_QOS_DriverIRQHandler
                BX      R0
                ENDP

ENET_QOS_PMT_IRQHandler\
                PROC
                EXPORT  ENET_QOS_PMT_IRQHandler         [WEAK]
                LDR     R0, =ENET_QOS_PMT_DriverIRQHandler
                BX      R0
                ENDP




Default_Handler\
                PROC
                EXPORT    MemManage_Handler [WEAK]
                EXPORT    BusFault_Handler [WEAK]
                EXPORT    UsageFault_Handler [WEAK]
                EXPORT    DebugMon_Handler [WEAK]
                EXPORT    DMA0_DMA16_DriverIRQHandler [WEAK]
                EXPORT    DMA1_DMA17_DriverIRQHandler [WEAK]
                EXPORT    DMA2_DMA18_DriverIRQHandler [WEAK]
                EXPORT    DMA3_DMA19_DriverIRQHandler [WEAK]
                EXPORT    DMA4_DMA20_DriverIRQHandler [WEAK]
                EXPORT    DMA5_DMA21_DriverIRQHandler [WEAK]
                EXPORT    DMA6_DMA22_DriverIRQHandler [WEAK]
                EXPORT    DMA7_DMA23_DriverIRQHandler [WEAK]
                EXPORT    DMA8_DMA24_DriverIRQHandler [WEAK]
                EXPORT    DMA9_DMA25_DriverIRQHandler [WEAK]
                EXPORT    DMA10_DMA26_DriverIRQHandler [WEAK]
                EXPORT    DMA11_DMA27_DriverIRQHandler [WEAK]
                EXPORT    DMA12_DMA28_DriverIRQHandler [WEAK]
                EXPORT    DMA13_DMA29_DriverIRQHandler [WEAK]
                EXPORT    DMA14_DMA30_DriverIRQHandler [WEAK]
                EXPORT    DMA15_DMA31_DriverIRQHandler [WEAK]
                EXPORT    DMA_ERROR_DriverIRQHandler [WEAK]
                EXPORT    CTI_TRIGGER_OUT0_IRQHandler [WEAK]
                EXPORT    CTI_TRIGGER_OUT1_IRQHandler [WEAK]
                EXPORT    CORE_IRQHandler [WEAK]
                EXPORT    LPUART1_DriverIRQHandler [WEAK]
                EXPORT    LPUART2_DriverIRQHandler [WEAK]
                EXPORT    LPUART3_DriverIRQHandler [WEAK]
                EXPORT    LPUART4_DriverIRQHandler [WEAK]
                EXPORT    LPUART5_DriverIRQHandler [WEAK]
                EXPORT    LPUART6_DriverIRQHandler [WEAK]
                EXPORT    LPUART7_DriverIRQHandler [WEAK]
                EXPORT    LPUART8_DriverIRQHandler [WEAK]
                EXPORT    LPUART9_DriverIRQHandler [WEAK]
                EXPORT    LPUART10_DriverIRQHandler [WEAK]
                EXPORT    LPUART11_DriverIRQHandler [WEAK]
                EXPORT    LPUART12_DriverIRQHandler [WEAK]
                EXPORT    LPI2C1_DriverIRQHandler [WEAK]
                EXPORT    LPI2C2_DriverIRQHandler [WEAK]
                EXPORT    LPI2C3_DriverIRQHandler [WEAK]
                EXPORT    LPI2C4_DriverIRQHandler [WEAK]
                EXPORT    LPI2C5_DriverIRQHandler [WEAK]
                EXPORT    LPI2C6_DriverIRQHandler [WEAK]
                EXPORT    LPSPI1_DriverIRQHandler [WEAK]
                EXPORT    LPSPI2_DriverIRQHandler [WEAK]
                EXPORT    LPSPI3_DriverIRQHandler [WEAK]
                EXPORT    LPSPI4_DriverIRQHandler [WEAK]
                EXPORT    LPSPI5_DriverIRQHandler [WEAK]
                EXPORT    LPSPI6_DriverIRQHandler [WEAK]
                EXPORT    CAN1_DriverIRQHandler [WEAK]
                EXPORT    CAN1_ERROR_DriverIRQHandler [WEAK]
                EXPORT    CAN2_DriverIRQHandler [WEAK]
                EXPORT    CAN2_ERROR_DriverIRQHandler [WEAK]
                EXPORT    CAN3_DriverIRQHandler [WEAK]
                EXPORT    CAN3_ERROR_DriverIRQHandler [WEAK]
                EXPORT    FLEXRAM_IRQHandler [WEAK]
                EXPORT    KPP_IRQHandler [WEAK]
                EXPORT    Reserved68_IRQHandler [WEAK]
                EXPORT    GPR_IRQ_IRQHandler [WEAK]
                EXPORT    eLCDIF_IRQHandler [WEAK]
                EXPORT    LCDIFv2_IRQHandler [WEAK]
                EXPORT    CSI_IRQHandler [WEAK]
                EXPORT    PXP_IRQHandler [WEAK]
                EXPORT    MIPI_CSI_IRQHandler [WEAK]
                EXPORT    MIPI_DSI_IRQHandler [WEAK]
                EXPORT    GPU2D_IRQHandler [WEAK]
                EXPORT    GPIO6_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO6_Combined_16_31_IRQHandler [WEAK]
                EXPORT    DAC_IRQHandler [WEAK]
                EXPORT    KEY_MANAGER_IRQHandler [WEAK]
                EXPORT    WDOG2_IRQHandler [WEAK]
                EXPORT    SNVS_HP_NON_TZ_IRQHandler [WEAK]
                EXPORT    SNVS_HP_TZ_IRQHandler [WEAK]
                EXPORT    SNVS_PULSE_EVENT_IRQHandler [WEAK]
                EXPORT    CAAM_IRQ0_IRQHandler [WEAK]
                EXPORT    CAAM_IRQ1_IRQHandler [WEAK]
                EXPORT    CAAM_IRQ2_IRQHandler [WEAK]
                EXPORT    CAAM_IRQ3_IRQHandler [WEAK]
                EXPORT    CAAM_RECORVE_ERRPR_IRQHandler [WEAK]
                EXPORT    CAAM_RTIC_IRQHandler [WEAK]
                EXPORT    CDOG_DriverIRQHandler [WEAK]
                EXPORT    SAI1_DriverIRQHandler [WEAK]
                EXPORT    SAI2_DriverIRQHandler [WEAK]
                EXPORT    SAI3_RX_DriverIRQHandler [WEAK]
                EXPORT    SAI3_TX_DriverIRQHandler [WEAK]
                EXPORT    SAI4_RX_DriverIRQHandler [WEAK]
                EXPORT    SAI4_TX_DriverIRQHandler [WEAK] 
                EXPORT    SPDIF_DriverIRQHandler [WEAK]
                EXPORT    ANATOP_TEMP_INT_IRQHandler [WEAK]
                EXPORT    ANATOP_TEMP_LOW_HIGH_IRQHandler [WEAK]
                EXPORT    ANATOP_TEMP_PANIC_IRQHandler [WEAK]
                EXPORT    ANATOP_LP8_BROWNOUT_IRQHandler [WEAK]
                EXPORT    ANATOP_LP0_BROWNOUT_IRQHandler [WEAK]
                EXPORT    ADC1_IRQHandler [WEAK]
                EXPORT    ADC2_IRQHandler [WEAK]
                EXPORT    USBPHY1_IRQHandler [WEAK]
                EXPORT    USBPHY2_IRQHandler [WEAK]
                EXPORT    RDC_IRQHandler [WEAK]
                EXPORT    GPIO13_Combined_0_31_IRQHandler [WEAK]
                EXPORT    Reserved110_IRQHandler [WEAK]
                EXPORT    DCIC1_IRQHandler [WEAK]
                EXPORT    DCIC2_IRQHandler [WEAK]
                EXPORT    ASRC_DriverIRQHandler [WEAK]
                EXPORT    FLEXRAM_ECC_IRQHandler [WEAK]
                EXPORT    CM7_GPIO2_3_IRQHandler [WEAK]
                EXPORT    GPIO1_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO1_Combined_16_31_IRQHandler [WEAK]
                EXPORT    GPIO2_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO2_Combined_16_31_IRQHandler [WEAK]
                EXPORT    GPIO3_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO3_Combined_16_31_IRQHandler [WEAK]
                EXPORT    GPIO4_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO4_Combined_16_31_IRQHandler [WEAK]
                EXPORT    GPIO5_Combined_0_15_IRQHandler [WEAK]
                EXPORT    GPIO5_Combined_16_31_IRQHandler [WEAK]
                EXPORT    FLEXIO1_DriverIRQHandler [WEAK]
                EXPORT    FLEXIO2_DriverIRQHandler [WEAK]
                EXPORT    WDOG1_IRQHandler [WEAK]
                EXPORT    RTWDOG3_IRQHandler [WEAK]
                EXPORT    EWM_IRQHandler [WEAK]
                EXPORT    OCOTP_READ_FUSE_ERROR_IRQHandler [WEAK]
                EXPORT    OCOTP_READ_DONE_ERROR_IRQHandler [WEAK]
                EXPORT    GPC_IRQHandler [WEAK]
                EXPORT    MUA_IRQHandler [WEAK]
                EXPORT    GPT1_IRQHandler [WEAK]
                EXPORT    GPT2_IRQHandler [WEAK]
                EXPORT    GPT3_IRQHandler [WEAK]
                EXPORT    GPT4_IRQHandler [WEAK]
                EXPORT    GPT5_IRQHandler [WEAK]
                EXPORT    GPT6_IRQHandler [WEAK]
                EXPORT    PWM1_0_IRQHandler [WEAK]
                EXPORT    PWM1_1_IRQHandler [WEAK]
                EXPORT    PWM1_2_IRQHandler [WEAK]
                EXPORT    PWM1_3_IRQHandler [WEAK]
                EXPORT    PWM1_FAULT_IRQHandler [WEAK]
                EXPORT    FLEXSPI1_DriverIRQHandler [WEAK]
                EXPORT    FLEXSPI2_DriverIRQHandler [WEAK]
                EXPORT    SEMC_IRQHandler [WEAK]
                EXPORT    USDHC1_DriverIRQHandler [WEAK]
                EXPORT    USDHC2_DriverIRQHandler [WEAK]
                EXPORT    USB_OTG2_IRQHandler [WEAK]
                EXPORT    USB_OTG1_IRQHandler [WEAK]
                EXPORT    ENET_DriverIRQHandler [WEAK]
                EXPORT    ENET_1588_Timer_DriverIRQHandler [WEAK]
                EXPORT    ENET_MAC0_Tx_Rx_Done_0_DriverIRQHandler [WEAK]
                EXPORT    ENET_MAC0_Tx_Rx_Done_1_DriverIRQHandler [WEAK]
                EXPORT    ENET_1G_DriverIRQHandler [WEAK]
                EXPORT    ENET_1G_1588_Timer_DriverIRQHandler [WEAK]
                EXPORT    XBAR1_IRQ_0_1_IRQHandler [WEAK]
                EXPORT    XBAR1_IRQ_2_3_IRQHandler [WEAK]
                EXPORT    ADC_ETC_IRQ0_IRQHandler [WEAK]
                EXPORT    ADC_ETC_IRQ1_IRQHandler [WEAK]
                EXPORT    ADC_ETC_IRQ2_IRQHandler [WEAK]
                EXPORT    ADC_ETC_IRQ3_IRQHandler [WEAK]
                EXPORT    ADC_ETC_ERROR_IRQ_IRQHandler [WEAK]
                EXPORT    Reserved166_IRQHandler [WEAK]
                EXPORT    Reserved167_IRQHandler [WEAK]
                EXPORT    Reserved168_IRQHandler [WEAK]
                EXPORT    Reserved169_IRQHandler [WEAK]
                EXPORT    Reserved170_IRQHandler [WEAK]
                EXPORT    PIT1_IRQHandler [WEAK]
                EXPORT    PIT2_IRQHandler [WEAK]
                EXPORT    ACMP1_IRQHandler [WEAK]
                EXPORT    ACMP2_IRQHandler [WEAK]
                EXPORT    ACMP3_IRQHandler [WEAK]
                EXPORT    ACMP4_IRQHandler [WEAK]
                EXPORT    Reserved177_IRQHandler [WEAK]
                EXPORT    Reserved178_IRQHandler [WEAK]
                EXPORT    Reserved179_IRQHandler [WEAK]
                EXPORT    Reserved180_IRQHandler [WEAK]
                EXPORT    ENC1_IRQHandler [WEAK]
                EXPORT    ENC2_IRQHandler [WEAK]
                EXPORT    ENC3_IRQHandler [WEAK]
                EXPORT    ENC4_IRQHandler [WEAK]
                EXPORT    Reserved185_IRQHandler [WEAK]
                EXPORT    Reserved186_IRQHandler [WEAK]
                EXPORT    TMR1_IRQHandler [WEAK]
                EXPORT    TMR2_IRQHandler [WEAK]
                EXPORT    TMR3_IRQHandler [WEAK]
                EXPORT    TMR4_IRQHandler [WEAK]
                EXPORT    SEMA4_CP0_IRQHandler [WEAK]
                EXPORT    SEMA4_CP1_IRQHandler [WEAK]
                EXPORT    PWM2_0_IRQHandler [WEAK]
                EXPORT    PWM2_1_IRQHandler [WEAK]
                EXPORT    PWM2_2_IRQHandler [WEAK]
                EXPORT    PWM2_3_IRQHandler [WEAK]
                EXPORT    PWM2_FAULT_IRQHandler [WEAK]
                EXPORT    PWM3_0_IRQHandler [WEAK]
                EXPORT    PWM3_1_IRQHandler [WEAK]
                EXPORT    PWM3_2_IRQHandler [WEAK]
                EXPORT    PWM3_3_IRQHandler [WEAK]
                EXPORT    PWM3_FAULT_IRQHandler [WEAK]
                EXPORT    PWM4_0_IRQHandler [WEAK]
                EXPORT    PWM4_1_IRQHandler [WEAK]
                EXPORT    PWM4_2_IRQHandler [WEAK]
                EXPORT    PWM4_3_IRQHandler [WEAK]
                EXPORT    PWM4_FAULT_IRQHandler [WEAK]
                EXPORT    Reserved208_IRQHandler [WEAK]
                EXPORT    Reserved209_IRQHandler [WEAK]
                EXPORT    Reserved210_IRQHandler [WEAK]
                EXPORT    Reserved211_IRQHandler [WEAK]
                EXPORT    Reserved212_IRQHandler [WEAK]
                EXPORT    Reserved213_IRQHandler [WEAK]
                EXPORT    Reserved214_IRQHandler [WEAK]
                EXPORT    Reserved215_IRQHandler [WEAK]
                EXPORT    HWVAD_EVENT_DriverIRQHandler [WEAK]
                EXPORT    HWVAD_ERROR_DriverIRQHandler [WEAK]
                EXPORT    PDM_EVENT_DriverIRQHandler [WEAK]
                EXPORT    PDM_ERROR_DriverIRQHandler [WEAK]
                EXPORT    EMVSIM1_IRQHandler [WEAK]
                EXPORT    EMVSIM2_IRQHandler [WEAK]
                EXPORT    MECC1_INT_IRQHandler [WEAK]
                EXPORT    MECC1_FATAL_INT_IRQHandler [WEAK]
                EXPORT    MECC2_INT_IRQHandler [WEAK]
                EXPORT    MECC2_FATAL_INT_IRQHandler [WEAK]
                EXPORT    XECC_FLEXSPI1_INT_DriverIRQHandler [WEAK]
                EXPORT    XECC_FLEXSPI1_FATAL_INT_DriverIRQHandler [WEAK]
                EXPORT    XECC_FLEXSPI2_INT_DriverIRQHandler [WEAK]
                EXPORT    XECC_FLEXSPI2_FATAL_INT_DriverIRQHandler [WEAK]
                EXPORT    XECC_SEMC_INT_IRQHandler [WEAK]
                EXPORT    XECC_SEMC_FATAL_INT_IRQHandler [WEAK]
                EXPORT    ENET_QOS_DriverIRQHandler [WEAK]
                EXPORT    ENET_QOS_PMT_DriverIRQHandler [WEAK]
                EXPORT    DefaultISR         [WEAK]
MemManage_Handler
BusFault_Handler
UsageFault_Handler
DebugMon_Handler
DMA0_DMA16_DriverIRQHandler
DMA1_DMA17_DriverIRQHandler
DMA2_DMA18_DriverIRQHandler
DMA3_DMA19_DriverIRQHandler
DMA4_DMA20_DriverIRQHandler
DMA5_DMA21_DriverIRQHandler
DMA6_DMA22_DriverIRQHandler
DMA7_DMA23_DriverIRQHandler
DMA8_DMA24_DriverIRQHandler
DMA9_DMA25_DriverIRQHandler
DMA10_DMA26_DriverIRQHandler
DMA11_DMA27_DriverIRQHandler
DMA12_DMA28_DriverIRQHandler
DMA13_DMA29_DriverIRQHandler
DMA14_DMA30_DriverIRQHandler
DMA15_DMA31_DriverIRQHandler
DMA_ERROR_DriverIRQHandler
CTI_TRIGGER_OUT0_IRQHandler
CTI_TRIGGER_OUT1_IRQHandler
CORE_IRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
LPUART5_DriverIRQHandler
LPUART6_DriverIRQHandler
LPUART7_DriverIRQHandler
LPUART8_DriverIRQHandler
LPUART9_DriverIRQHandler
LPUART10_DriverIRQHandler
LPUART11_DriverIRQHandler
LPUART12_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPI2C3_DriverIRQHandler
LPI2C4_DriverIRQHandler
LPI2C5_DriverIRQHandler
LPI2C6_DriverIRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPSPI3_DriverIRQHandler
LPSPI4_DriverIRQHandler
LPSPI5_DriverIRQHandler
LPSPI6_DriverIRQHandler
CAN1_DriverIRQHandler
CAN1_ERROR_DriverIRQHandler
CAN2_DriverIRQHandler
CAN2_ERROR_DriverIRQHandler
CAN3_DriverIRQHandler
CAN3_ERROR_DriverIRQHandler
FLEXRAM_IRQHandler
KPP_IRQHandler
Reserved68_IRQHandler
GPR_IRQ_IRQHandler
eLCDIF_IRQHandler
LCDIFv2_IRQHandler
CSI_IRQHandler
PXP_IRQHandler
MIPI_CSI_IRQHandler
MIPI_DSI_IRQHandler
GPU2D_IRQHandler
GPIO6_Combined_0_15_IRQHandler
GPIO6_Combined_16_31_IRQHandler
DAC_IRQHandler
KEY_MANAGER_IRQHandler
WDOG2_IRQHandler
SNVS_HP_NON_TZ_IRQHandler
SNVS_HP_TZ_IRQHandler
SNVS_PULSE_EVENT_IRQHandler
CAAM_IRQ0_IRQHandler
CAAM_IRQ1_IRQHandler
CAAM_IRQ2_IRQHandler
CAAM_IRQ3_IRQHandler
CAAM_RECORVE_ERRPR_IRQHandler
CAAM_RTIC_IRQHandler
CDOG_DriverIRQHandler
SAI1_DriverIRQHandler
SAI2_DriverIRQHandler
SAI3_RX_DriverIRQHandler
SAI3_TX_DriverIRQHandler
SAI4_RX_DriverIRQHandler
SAI4_TX_DriverIRQHandler
SPDIF_DriverIRQHandler
ANATOP_TEMP_INT_IRQHandler
ANATOP_TEMP_LOW_HIGH_IRQHandler
ANATOP_TEMP_PANIC_IRQHandler
ANATOP_LP8_BROWNOUT_IRQHandler
ANATOP_LP0_BROWNOUT_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
USBPHY1_IRQHandler
USBPHY2_IRQHandler
RDC_IRQHandler
GPIO13_Combined_0_31_IRQHandler
Reserved110_IRQHandler
DCIC1_IRQHandler
DCIC2_IRQHandler
ASRC_DriverIRQHandler
FLEXRAM_ECC_IRQHandler
CM7_GPIO2_3_IRQHandler
GPIO1_Combined_0_15_IRQHandler
GPIO1_Combined_16_31_IRQHandler
GPIO2_Combined_0_15_IRQHandler
GPIO2_Combined_16_31_IRQHandler
GPIO3_Combined_0_15_IRQHandler
GPIO3_Combined_16_31_IRQHandler
GPIO4_Combined_0_15_IRQHandler
GPIO4_Combined_16_31_IRQHandler
GPIO5_Combined_0_15_IRQHandler
GPIO5_Combined_16_31_IRQHandler
FLEXIO1_DriverIRQHandler
FLEXIO2_DriverIRQHandler
WDOG1_IRQHandler
RTWDOG3_IRQHandler
EWM_IRQHandler
OCOTP_READ_FUSE_ERROR_IRQHandler
OCOTP_READ_DONE_ERROR_IRQHandler
GPC_IRQHandler
MUA_IRQHandler
GPT1_IRQHandler
GPT2_IRQHandler
GPT3_IRQHandler
GPT4_IRQHandler
GPT5_IRQHandler
GPT6_IRQHandler
PWM1_0_IRQHandler
PWM1_1_IRQHandler
PWM1_2_IRQHandler
PWM1_3_IRQHandler
PWM1_FAULT_IRQHandler
FLEXSPI1_DriverIRQHandler
FLEXSPI2_DriverIRQHandler
SEMC_IRQHandler
USDHC1_DriverIRQHandler
USDHC2_DriverIRQHandler
USB_OTG2_IRQHandler
USB_OTG1_IRQHandler
ENET_DriverIRQHandler
ENET_1588_Timer_DriverIRQHandler
ENET_MAC0_Tx_Rx_Done_0_DriverIRQHandler
ENET_MAC0_Tx_Rx_Done_1_DriverIRQHandler
ENET_1G_DriverIRQHandler
ENET_1G_1588_Timer_DriverIRQHandler
XBAR1_IRQ_0_1_IRQHandler
XBAR1_IRQ_2_3_IRQHandler
ADC_ETC_IRQ0_IRQHandler
ADC_ETC_IRQ1_IRQHandler
ADC_ETC_IRQ2_IRQHandler
ADC_ETC_IRQ3_IRQHandler
ADC_ETC_ERROR_IRQ_IRQHandler
Reserved166_IRQHandler
Reserved167_IRQHandler
Reserved168_IRQHandler
Reserved169_IRQHandler
Reserved170_IRQHandler
PIT1_IRQHandler
PIT2_IRQHandler
ACMP1_IRQHandler
ACMP2_IRQHandler
ACMP3_IRQHandler
ACMP4_IRQHandler
Reserved177_IRQHandler
Reserved178_IRQHandler
Reserved179_IRQHandler
Reserved180_IRQHandler
ENC1_IRQHandler
ENC2_IRQHandler
ENC3_IRQHandler
ENC4_IRQHandler
Reserved185_IRQHandler
Reserved186_IRQHandler
TMR1_IRQHandler
TMR2_IRQHandler
TMR3_IRQHandler
TMR4_IRQHandler
SEMA4_CP0_IRQHandler
SEMA4_CP1_IRQHandler
PWM2_0_IRQHandler
PWM2_1_IRQHandler
PWM2_2_IRQHandler
PWM2_3_IRQHandler
PWM2_FAULT_IRQHandler
PWM3_0_IRQHandler
PWM3_1_IRQHandler
PWM3_2_IRQHandler
PWM3_3_IRQHandler
PWM3_FAULT_IRQHandler
PWM4_0_IRQHandler
PWM4_1_IRQHandler
PWM4_2_IRQHandler
PWM4_3_IRQHandler
PWM4_FAULT_IRQHandler
Reserved208_IRQHandler
Reserved209_IRQHandler
Reserved210_IRQHandler
Reserved211_IRQHandler
Reserved212_IRQHandler
Reserved213_IRQHandler
Reserved214_IRQHandler
Reserved215_IRQHandler
HWVAD_EVENT_DriverIRQHandler
HWVAD_ERROR_DriverIRQHandler
PDM_EVENT_DriverIRQHandler
PDM_ERROR_DriverIRQHandler
EMVSIM1_IRQHandler
EMVSIM2_IRQHandler
MECC1_INT_IRQHandler
MECC1_FATAL_INT_IRQHandler
MECC2_INT_IRQHandler
MECC2_FATAL_INT_IRQHandler
XECC_FLEXSPI1_INT_DriverIRQHandler
XECC_FLEXSPI1_FATAL_INT_DriverIRQHandler
XECC_FLEXSPI2_INT_DriverIRQHandler
XECC_FLEXSPI2_FATAL_INT_DriverIRQHandler
XECC_SEMC_INT_IRQHandler
XECC_SEMC_FATAL_INT_IRQHandler
ENET_QOS_DriverIRQHandler
ENET_QOS_PMT_DriverIRQHandler
DefaultISR
                LDR    R0, =DefaultISR
                BX     R0
                ENDP
                  ALIGN


                END
